УТ_для_edt/src/InformationRegisters/CRM_СостояниеПользователейСинхронизации/CRM_СостояниеПользователейСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СостояниеПользователейСинхронизации</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.CRM_СостоянияСинхронизацииПользователя</types>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиПриглашения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетПодписку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ДанныеДляВыгрузкиВiCRM/CRM_ДанныеДляВыгрузкиВiCRM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ДанныеДляВыгрузкиВiCRM</name>
  <resources>
    <name>ДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВремяФайла</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.CRM_СинхронизацияСМобильнымПриложениемНовый</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ДатыОбращенийiCRM/CRM_ДатыОбращенийiCRM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ДатыОбращенийiCRM</name>
  <resources>
    <name>ДатаПоследнегоОбращения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.CRM_СинхронизацияСМобильнымПриложениемНовый</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Ключевой</name>
    <comment>Ключевой контакт</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЛичныеИнтересы</name>
    <comment>Личные интересы контактного лица</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЛогинНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Состояние</name>
    <type>
      <types>EnumRef.CRM_Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Взаимодействия</name>
    <comment>Взаимодействия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ВладелецБизнеса</name>
    <comment>Владелец бизнеса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Заказчик</name>
    <comment>Заказчик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Противник</name>
    <comment>Противник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Прочее</name>
    <comment>Прочее</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Спонсор</name>
    <comment>Спонсор</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Сторонник</name>
    <comment>Сторонник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТелефонНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартИдентификаторБитрикс</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартАктивностьНаСайте</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_КлючевыеСобытия</name>
    <comment>Ключевые события контакта</comment>
    <attributes>
      <name>ВидСобытия</name>
      <comment>Вид ключевого события</comment>
      <type>
        <types>CatalogRef.CRM_ВидыКлючевыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСобытия</name>
      <comment>Дата ключевого события</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапоминатьОСобытии</name>
      <comment>Напоминать о ключевом событии</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.CRM_СтатусыКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/WebServices/CRM_MobileAppExchange/Module.bsl
#Область ПрограммныйИнтерфейс

Функция Registration(IMEI, SettingsID)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_СостояниеПользователейСинхронизации.IMEI КАК IMEI,
	|	CRM_СостояниеПользователейСинхронизации.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.CRM_СостояниеПользователейСинхронизации КАК CRM_СостояниеПользователейСинхронизации
	|ГДЕ
	|	CRM_СостояниеПользователейСинхронизации.Идентификатор = &SettingsID";
	Запрос.УстановитьПараметр("SettingsID", SettingsID);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат "Пользователь с таким идентификатором не зарегистрирован";
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.CRM_СостояниеПользователейСинхронизации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(SettingsID);
	НаборЗаписей.Прочитать();
	Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
		ЗаписьРегистра.IMEI = IMEI;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	СтрокаНастроек = CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПолучитьФайлНастроекПользователя(SettingsID);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат XMLСтрока(СтрокаНастроек);
КонецФункции

Функция GetSettings(SettingsID)
	УстановитьПривилегированныйРежим(Истина);
	СтрокаНастроек = CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПолучитьФайлНастроекПользователя(SettingsID);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат XMLСтрока(СтрокаНастроек); 
КонецФункции


Функция PutData(SettingsID, Data)
	УстановитьПривилегированныйРежим(Истина);
	ФайлЗагрузки = ПолучитьИмяВременногоФайла("xml");
	Data.Записать(ФайлЗагрузки);
	ОбработкаЗагрузки = Обработки.CRM_УниверсальныйОбменДаннымиXML.Создать();
	ОбработкаЗагрузки.ИмяФайлаОбмена = ФайлЗагрузки;
	ОбработкаЗагрузки.БезопаснаяЗагрузка = Ложь;
	ОбработкаЗагрузки.ЗагружатьДанныеВРежимеОбмена = Истина;
	ОбработкаЗагрузки.ОптимизированнаяЗаписьОбъектов = Истина;
	ОбработкаЗагрузки.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
	ОбработкаЗагрузки.РежимОбмена = "Загрузка";
	РезультатЗагрузки = ОбработкаЗагрузки.ВыгрузитьДанныеCRM();
	УдалитьФайлы(ФайлЗагрузки);
	УстановитьПривилегированныйРежим(Ложь);
	Если РезультатЗагрузки Тогда
		Возврат "Данные успешно загружены";
	Иначе
		Возврат "Данные не загружены";	
	КонецЕсли;	
КонецФункции


Функция GetData(DataID)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДляВыгрузкиВiCRM.ИдентификаторФайла КАК ИдентификаторФайла,
	|	ДанныеДляВыгрузкиВiCRM.Размер КАК Размер,
	|	ДанныеДляВыгрузкиВiCRM.ДанныеФайла КАК ДанныеФайла,
	|	ДанныеДляВыгрузкиВiCRM.ВремяФайла КАК ВремяФайла
	|ИЗ
	|	РегистрСведений.CRM_ДанныеДляВыгрузкиВiCRM КАК ДанныеДляВыгрузкиВiCRM
	|ГДЕ
	|	ДанныеДляВыгрузкиВiCRM.ИдентификаторФайла = &DataID
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДляВыгрузкиВiCRM.ВремяФайла";
	Запрос.УстановитьПараметр("DataID", DataID);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат "Нет данных для выгрузки";
	КонецЕсли;	
	Выборка = Результат.Выгрузить();
	Если Выборка.Количество() > 0 Тогда
		Для Каждого Строка Из Выборка Цикл
			ДанныеВыгрузки = Строка.ДанныеФайла;
			
			ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
			Объект = ФабрикаXDTO.Создать(ТипХранилище, ДанныеВыгрузки);
			
			Запись = Новый ЗаписьXML;
			Запись.УстановитьСтроку();
			ФабрикаXDTO.ЗаписатьXML(Запись, Объект);
			Строка = Запись.Закрыть();
			
			Возврат Строка; 
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат "Нет данных для выгрузки";
КонецФункции

Функция GetDataID(SettingsID)
	УстановитьПривилегированныйРежим(Истина);
	УзелОбмена = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.НайтиПоКоду(SettingsID);
	Если УзелОбмена.Пустая() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат "Нет данных для выгрузки";
	КонецЕсли;	
	
	МенеджерЗаписи = РегистрыСведений.CRM_ДатыОбращенийiCRM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УзелОбмена = УзелОбмена;
	МенеджерЗаписи.ДатаПоследнегоОбращения = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_СостояниеПользователейСинхронизации.IMEI КАК IMEI,
	|	CRM_СостояниеПользователейСинхронизации.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.CRM_СостояниеПользователейСинхронизации КАК CRM_СостояниеПользователейСинхронизации
	|ГДЕ
	|	CRM_СостояниеПользователейСинхронизации.Идентификатор = &SettingsID";
	Запрос.УстановитьПараметр("SettingsID", SettingsID);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат "Нет данных для выгрузки";
	КонецЕсли;	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДанныеДляВыгрузкиВiCRM.ИдентификаторФайла КАК ИдентификаторФайла,
		|	ДанныеДляВыгрузкиВiCRM.Размер КАК Размер,
		|	ДанныеДляВыгрузкиВiCRM.ДанныеФайла КАК ДанныеФайла,
		|	ДанныеДляВыгрузкиВiCRM.ВремяФайла КАК ВремяФайла
		|ИЗ
		|	РегистрСведений.CRM_ДанныеДляВыгрузкиВiCRM КАК ДанныеДляВыгрузкиВiCRM
		|ГДЕ
		|	ДанныеДляВыгрузкиВiCRM.УзелОбмена = &УзелОбмена
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДляВыгрузкиВiCRM.ВремяФайла";
		Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			УстановитьПривилегированныйРежим(Ложь);
			Возврат "Нет данных для выгрузки";
		КонецЕсли;	
		Выборка = Результат.Выгрузить();
		Если Выборка.Количество() > 0 Тогда
			ДанныеВыгрузки = Новый ЗаписьXML;
			ДанныеВыгрузки.УстановитьСтроку();
			ДанныеВыгрузки.ЗаписатьНачалоЭлемента("IDStruc");
			Для Каждого Строка Из Выборка Цикл
				ДанныеВыгрузки.ЗаписатьНачалоЭлемента("ID");
				ДанныеВыгрузки.ЗаписатьАтрибут("Value", Строка.ИдентификаторФайла);
				ДанныеВыгрузки.ЗаписатьКонецЭлемента(); 
			КонецЦикла;
			ДанныеВыгрузки.ЗаписатьКонецЭлемента();
			УстановитьПривилегированныйРежим(Ложь);
			Возврат ДанныеВыгрузки.Закрыть();
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		Возврат "Нет данных для выгрузки";
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);	
	Возврат "Нет данных для выгрузки";

КонецФункции

Функция PutConfirmation(DataID)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДляВыгрузкиВiCRM.ИдентификаторФайла КАК ИдентификаторФайла,
	|	ДанныеДляВыгрузкиВiCRM.Размер КАК Размер,
	|	ДанныеДляВыгрузкиВiCRM.ДанныеФайла КАК ДанныеФайла,
	|	ДанныеДляВыгрузкиВiCRM.ВремяФайла КАК ВремяФайла
	|ИЗ
	|	РегистрСведений.CRM_ДанныеДляВыгрузкиВiCRM КАК ДанныеДляВыгрузкиВiCRM
	|ГДЕ
	|	ДанныеДляВыгрузкиВiCRM.ИдентификаторФайла = &DataID
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДляВыгрузкиВiCRM.ВремяФайла";
	Запрос.УстановитьПараметр("DataID", DataID);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		//УстановитьПривилегированныйРежим(Ложь);
		Возврат "Нет данных для выгрузки";
	КонецЕсли;
	НаборРегистра = РегистрыСведений.CRM_ДанныеДляВыгрузкиВiCRM.СоздатьНаборЗаписей();
	НаборРегистра.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборРегистра.Отбор.ИдентификаторФайла.Установить(DataID);
	НаборРегистра.Записать(Истина);
	Возврат "Принято";
КонецФункции

Функция GetUpdate(DataID, Data, SettingsID)
	УзелОбмена = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.НайтиПоКоду(SettingsID);
	Если DataID = "СостоянияИнтереса" Тогда
		Состояние = Справочники.CRM_СостоянияИнтересов.НайтиПокоду(Data);
		Если Не Состояние.Пустая() Тогда
			Возврат XMLСтрока(ЗначениеЗаполнено(Состояние.ОбязательноеПланированиеАктивности));
		КонецЕсли;	
	КонецЕсли;	
	Если DataID = "ПоискКлиентов" Тогда
		ТаблицаКлиентов = НайтиКонтрагентов(Data);
		ТаблицаКлиентов.Колонки.Удалить("Ссылка");
		Сжатие = Новый СжатиеДанных(6);
		ДанныеФайла = Новый ХранилищеЗначения(ТаблицаКлиентов, Сжатие);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		Объект = ФабрикаXDTO.Создать(ТипХранилище, ДанныеФайла);
		
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(Запись, Объект);
		СтрокаВозврата = Запись.Закрыть();
		Возврат СтрокаВозврата;	
	КонецЕсли;	
	Если DataID = "ЗагрузкаКлиентов" Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Data);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение, ТипХранилище);
		Хранилище = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
		
		ТаблицаКлиентов = Хранилище.Получить();
		МассивСсылок = ПолучитьМассивСсылокДляВыгрузкиКлиентов(ТаблицаКлиентов);
		СтрокаВозврата = ВыгрузитьПорциюДанных(МассивСсылок, УзелОбмена);
		Возврат СтрокаВозврата;	
	КонецЕсли;	
	Если DataID = "ПоискНоменклатуры" Тогда
		ТаблицаКлиентов = НайтиНоменклатуру(Data);
		ТаблицаКлиентов.Колонки.Удалить("Ссылка");
		Сжатие = Новый СжатиеДанных(6);
		ДанныеФайла = Новый ХранилищеЗначения(ТаблицаКлиентов, Сжатие);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		Объект = ФабрикаXDTO.Создать(ТипХранилище, ДанныеФайла);
		
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(Запись, Объект);
		СтрокаВозврата = Запись.Закрыть();
		Возврат СтрокаВозврата;	
	КонецЕсли;
	Если DataID = "ЗагрузкаНоменклатуры" Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Data);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение, ТипХранилище);
		Хранилище = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
		
		ТаблицаНоменклатуры = Хранилище.Получить();
		МассивСсылок = ПолучитьМассивСсылокДляВыгрузкиНоменклатуры(ТаблицаНоменклатуры);
		СтрокаВозврата = ВыгрузитьПорциюДанных(МассивСсылок, УзелОбмена);
		Возврат СтрокаВозврата;	
	КонецЕсли;
	Если DataID = "ЗагрузкаДокументов" Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Data);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение, ТипХранилище);
		Хранилище = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
		
		СтруктураПараметров = Хранилище.Получить();
		МассивСсылок = ПолучитьМассивСсылокДляВыгрузкиДокументов(СтруктураПараметров);
		СтрокаВозврата = ВыгрузитьПорциюДанных(МассивСсылок, УзелОбмена);
		Возврат СтрокаВозврата;	
	КонецЕсли;
	Если DataID = "СсылкиДляПроверки" Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Data);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение, ТипХранилище);
		Хранилище = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
		ТаблицаДляПроверки = Хранилище.Получить();
		ОбработатьТаблицуПомеченныхссылок(ТаблицаДляПроверки);
		Сжатие = Новый СжатиеДанных(6);
		ДанныеФайла = Новый ХранилищеЗначения(ТаблицаДляПроверки, Сжатие);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипХранилище, ДанныеФайла);
		
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектXDTO);
		СтрокаВозврата = Запись.Закрыть();
		Возврат СтрокаВозврата;	
	КонецЕсли;

КонецФункции

Процедура ОбработатьТаблицуПомеченныхссылок(ТаблицаДляПроверки)  
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ТаблицаДляЗагрузки = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ПолучитьМакет("СоответствиеОбъектовCRM_iCRM"); 
	Иначе  
		ТаблицаДляЗагрузки = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ПолучитьМакет("СоответствиеОбъектовУТ_iCRM");
	КонецЕсли;	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДляЗагрузки.Область(1, 1, ТаблицаДляЗагрузки.ВысотаТаблицы, ТаблицаДляЗагрузки.ШиринаТаблицы));
	Построитель.Выполнить();
	ТаблицаЗначений = Построитель.Результат.Выгрузить();
	
	Для Каждого Строка Из ТаблицаДляПроверки Цикл
		СтрокаТипа = ТаблицаЗначений.Найти(Строка.ВидОбъекта+"."+Строка.ТипОбъекта,"iCRM");
		ИмяОбъекта = СтрокаТипа.CRM;
		Поз = СтрНайти(ИмяОбъекта, ".");
		ВидОбъекта = Лев(ИмяОбъекта, Поз-1);
		ТипОбъекта = СтрЗаменить(ИмяОбъекта, ВидОбъекта+".", "");
		Если ВидОбъекта = "Справочник" Тогда
			НайденнаяСсылка = Справочники[ТипОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.Идентификатор));
		ИначеЕсли ВидОбъекта = "Документ" Тогда
			НайденнаяСсылка = Документы[ТипОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.Идентификатор));	
		КонецЕсли;	
		Строка.МожноУдалять = НайденнаяСсылка.Пустая() ИЛИ (НайденнаяСсылка.получитьОбъект() = Неопределено);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьМассивСсылокДляВыгрузкиДокументов(СтруктураПараметров)
	Контрагент = Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураПараметров.ИдКлиента));
	ДатаНачала = СтруктураПараметров.ДатаНачала;
	ДатаОкончания = СтруктураПараметров.ДатаОкончания;
	МассивСсылок = Новый Массив;
	Запрос = Новый Запрос;  
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_Интерес.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	CRM_Интерес.Партнер = &Партнер
		|	И CRM_Интерес.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ CRM_Интерес.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CRM_СчетНаОплатуПокупателю.Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК CRM_СчетНаОплатуПокупателю
		|ГДЕ
		|	CRM_СчетНаОплатуПокупателю.Партнер = &Партнер
		|	И CRM_СчетНаОплатуПокупателю.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ CRM_СчетНаОплатуПокупателю.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КоммерческоеПредложениеКлиенту.Ссылка
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
		|ГДЕ
		|	КоммерческоеПредложениеКлиенту.Клиент = &Партнер
		|	И КоммерческоеПредложениеКлиенту.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ КоммерческоеПредложениеКлиенту.ПометкаУдаления";    
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_Интерес.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	CRM_Интерес.Партнер = &Партнер
		|	И CRM_Интерес.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ CRM_Интерес.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CRM_СчетНаОплатуПокупателю.Ссылка
		|ИЗ
		|	Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
		|ГДЕ
		|	CRM_СчетНаОплатуПокупателю.Партнер = &Партнер
		|	И CRM_СчетНаОплатуПокупателю.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ CRM_СчетНаОплатуПокупателю.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КоммерческоеПредложениеКлиенту.Ссылка
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
		|ГДЕ
		|	КоммерческоеПредложениеКлиенту.Партнер = &Партнер
		|	И КоммерческоеПредложениеКлиенту.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ КоммерческоеПредложениеКлиенту.ПометкаУдаления";   
	КонецЕсли;
	Запрос.УстановитьПараметр("Партнер", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСсылок.Добавить(Выборка.Ссылка);	
	КонецЦикла;	
	Возврат МассивСсылок;
КонецФункции

Функция ПолучитьМассивСсылокДляВыгрузкиКлиентов(ТаблицаКлиентов)
	УстановитьПривилегированныйРежим(Истина);
	МассивСсылок = Новый Массив;
	Для Каждого Строка Из ТаблицаКлиентов Цикл
		Если Строка.Загружать Тогда
			МассивСсылок.Добавить(Справочники.Партнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ИД_Ссылки)));
		КонецЕсли;	
	КонецЦикла;	
	Запрос = Новый Запрос;    
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Партнер В(&МассивСсылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Владелец В(&МассивСсылок)";  
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец В(&МассивСсылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Владелец В(&МассивСсылок)";   
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			МассивСсылок.Добавить(Выборка.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат МассивСсылок;
КонецФункции

Функция ПолучитьМассивСсылокДляВыгрузкиНоменклатуры(ТаблицаНоменклатуры)
	УстановитьПривилегированныйРежим(Истина);

	МассивСсылок = Новый Массив;
	МассивНоменклатуры = Новый Массив;
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Если Строка.Загружать Тогда
			МассивСсылок.Добавить(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ИД_Ссылки)));
			МассивНоменклатуры.Добавить(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ИД_Ссылки)));
		КонецЕсли;	
	КонецЦикла;	
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура В (&МассивНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних";
		Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Набор = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(Выборка.Период);
			Набор.Отбор.ВидЦен.Установить(Выборка.ВидЦен);
			Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			Набор.Отбор.Характеристика.Установить(Выборка.Характеристика);
			Набор.Прочитать();	
			Если Набор.Количество() > 0 Тогда
				МассивСсылок.Добавить(Набор);	
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;         
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец В(&МассивНоменклатуры)";
		Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				МассивСсылок.Добавить(Выборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат МассивСсылок;
КонецФункции

Функция СтруктураДанныхКэша()
	
	ДанныеКэша = Новый Структура;
	ДанныеКэша.Вставить("ИНН",			"");
	ДанныеКэша.Вставить("ФИО",			"");
	ДанныеКэша.Вставить("Организация",	"");
	ДанныеКэша.Вставить("Телефон",		"");
	ДанныеКэша.Вставить("Email",		"");
	ДанныеКэша.Вставить("URL",			"");
	
	Возврат ДанныеКэша;
	
КонецФункции

Функция НайтиКонтрагентов(СтрокаПоиска)
	КэшПоиска = СтруктураДанныхКэша();
	КэшЗаполнения = СтруктураДанныхКэша();
	УсловияПоиска = Новый Массив;
	Если Не ПустаяСтрока(СтрокаПоиска) Тогда
		СтрокаПоискаНормализованная = НормализоватьСтрокуПоискаИДополнитьКэш(СтрокаПоиска, КэшПоиска, КэшЗаполнения);
		УсловияПоиска.Добавить(СтрокаПоискаНормализованная);
	КонецЕсли;
	Массивссылок = Новый Массив;
	РезультатПоиска = CRM_ПоискКонтактов.ВыполнитьПоискКонтактов(УсловияПоиска, 1, Истина);
	Если НЕ ЗначениеЗаполнено(РезультатПоиска.КодОшибки) Тогда
		Массивссылок = РезультатПоиска.Элементы;
	КонецЕсли;
	Запрос = Новый Запрос;
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Партнеры.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ тмпСсылки
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.Ссылка В(&Массивссылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеров.Владелец
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Ссылка В(&Массивссылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	тмпСсылки.Ссылка КАК Ссылка,
		|	тмпСсылки.Ссылка.Наименование КАК Наименование,
		|	тмпСсылки.Ссылка.CRM_ИНН КАК ИНН
		|ИЗ
		|	тмпСсылки КАК тмпСсылки";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Партнеры.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ тмпСсылки
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.Ссылка В(&Массивссылок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеров.Владелец
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Ссылка В(&Массивссылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	тмпСсылки.Ссылка КАК Ссылка,
		|	тмпСсылки.Ссылка.Наименование КАК Наименование,
		|	"""" КАК ИНН
		|ИЗ
		|	тмпСсылки КАК тмпСсылки";

	КонецЕсли;
	Запрос.УстановитьПараметр("Массивссылок", Массивссылок);
	ТаблицаКлиентов = Запрос.Выполнить().Выгрузить();
	ТаблицаКлиентов.Колонки.Добавить("ИД_Ссылки");
	ТаблицаКлиентов.Колонки.Добавить("Загружать");
	Для Каждого Строка Из ТаблицаКлиентов Цикл
		Строка.ИД_Ссылки = Строка.Ссылка.УникальныйИдентификатор();
		Строка.Загружать = Истина;
	КонецЦикла;	
	Возврат ТаблицаКлиентов;
КонецФункции

Функция НайтиНоменклатуру(СтрокаПоиска)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(Номенклатура.Наименование ПОДОБНО &СтрокаПоиска
	|			ИЛИ Номенклатура.Артикул ПОДОБНО &СтрокаПоиска)
	|	И НЕ Номенклатура.ЭтоГруппа";
	Запрос.УстановитьПараметр("СтрокаПоиска", "%"+СокрЛП(СтрокаПоиска)+"%");
	ТаблицаКлиентов = Запрос.Выполнить().Выгрузить();
	ТаблицаКлиентов.Колонки.Добавить("ИД_Ссылки");
	ТаблицаКлиентов.Колонки.Добавить("Загружать");
	Для Каждого Строка Из ТаблицаКлиентов Цикл
		Строка.ИД_Ссылки = Строка.Ссылка.УникальныйИдентификатор();
		Строка.Загружать = Истина;
	КонецЦикла;	
	Возврат ТаблицаКлиентов;
КонецФункции


Функция НормализоватьСтрокуПоискаИДополнитьКэш(Знач СтрокаПоиска, КэшПоиска, КэшЗаполнения)
	
	Если РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(СтрокаПоиска, Истина, "") Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.ИНН) Тогда
			КэшПоиска.ИНН = СтрокаПоиска;
			КэшЗаполнения.ИНН = СтрокаПоиска;
		КонецЕсли;
		
	ИначеЕсли РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(СтрокаПоиска, Ложь, "") Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.ИНН) Тогда
			КэшПоиска.ИНН = СтрокаПоиска;
			КэшЗаполнения.ИНН = СтрокаПоиска;
		КонецЕсли;
		
	ИначеЕсли Взаимодействия.КорректноВведенНомерТелефона(СтрокаПоиска) Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.Телефон) Тогда
			КэшПоиска.Телефон = CRM_ПоискКонтактов.ФорматироватьНомерДляПоиска(СтрокаПоиска);
			СтруктураКИ = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(СтрокаПоиска);
			КэшЗаполнения.Телефон = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураКИ.КодСтраны, СтруктураКИ.КодГорода, СтруктураКИ.НомерТелефона, "", "");
		КонецЕсли;
		СтрокаПоиска = КэшПоиска.Телефон;
		
	ИначеЕсли ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(СтрокаПоиска, Истина) Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.Email) Тогда
			КэшПоиска.Email = СтрокаПоиска;
			КэшЗаполнения.Email = СтрокаПоиска;
		КонецЕсли;
		
	ИначеЕсли ЭтоURL(СтрокаПоиска) Тогда
		
		Если Не ЗначениеЗаполнено(КэшПоиска.URL) Тогда
			КэшПоиска.URL = СтрокаПоиска;
			КэшЗаполнения.URL = СтрокаПоиска;
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КэшПоиска.ФИО) Тогда
			КэшПоиска.ФИО = СтрокаПоиска;
			КэшЗаполнения.ФИО = CRM_КлиентыСервер.ПривестиФИОКСтандартномуВиду(СтрокаПоиска);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КэшПоиска.Организация) Тогда
			КэшПоиска.Организация = СтрокаПоиска;
			КэшЗаполнения.Организация = СтрокаПоиска;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаПоиска;
	
КонецФункции

Функция ЭтоURL(Знач Строка)
	
	Если СтрНайти(Строка, "https:") > 0
		Или СтрНайти(Строка, "http:") > 0 Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура УстановитьУзелОбменаУСтрокДерева(Дерево, УзелОбмена)
	
	Для Каждого Строка Из Дерево.Строки Цикл
		
		Если Строка.ЭтоГруппа Тогда
			
			УстановитьУзелОбменаУСтрокДерева(Строка, УзелОбмена);
			
		Иначе
			
			Строка.СсылкаНаУзелОбмена = УзелОбмена;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыгрузитьПорциюДанных(МассивОбъектовДляВыгрузки, Узел)
	УстановитьПривилегированныйРежим(Истина);
	ОбработкаОбмена = Обработки.CRM_УниверсальныйОбменДаннымиXML.Создать();
	
	ИмяФайлаПравил = ПолучитьИмяВременногоФайла("xml");
	ИмяФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		МакетПравил = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ПолучитьМакет("CRM_ПравилаОбмена");
	Иначе 
		МакетПравил = ПланыОбмена.CRM_СинхронизацияСМобильнымПриложениемНовый.ПолучитьМакет("УТ_ПравилаКонвертации");
	КонецЕсли;
	МакетПравил.Записать(ИмяФайлаПравил);
	
	//ДДПравил = Узел.ПравилаОбмена.Получить();
	//ДДПравил.Записать(ИмяФайлаПравил);	
	ОбработкаОбмена.ИмяФайлаОбмена = ИмяФайлаОбмена;
	ОбработкаОбмена.ИмяФайлаПравилОбмена = ИмяФайлаПравил;
	ОбработкаОбмена.ЗагрузитьПравилаОбмена();
	ОбработкаОбмена.ИнициализироватьПервоначальныеЗначенияПараметров();
	ОбработкаОбмена.Параметры.Очистить();
	ОбработкаОбмена.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 0;
	УстановитьУзелОбменаУСтрокДерева(ОбработкаОбмена.ТаблицаПравилВыгрузки, Узел);
	
	РезультатВыгрузки = Ложь;
	ОбработкаОбмена.ВыполнитьВыгрузкуCRM(МассивОбъектовДляВыгрузки, РезультатВыгрузки);
	Строка = "";
	Если РезультатВыгрузки Тогда  
		
		ДанныеВыгрузки = Новый ДвоичныеДанные(ИмяФайлаОбмена);
		Сжатие = Новый СжатиеДанных(6);
	
		
		ДанныеФайла = Новый ХранилищеЗначения(ДанныеВыгрузки, Сжатие);
		ТипХранилище = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueStorage");
		Объект = ФабрикаXDTO.Создать(ТипХранилище, ДанныеФайла);
		
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(Запись, Объект);
		Строка = Запись.Закрыть();
		
	КонецЕсли;
	
	УдалитьФайлы(ИмяФайлаОбмена);
	
	УдалитьФайлы(ИмяФайлаПравил);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Строка;
КонецФункции

#КонецОбласти
